core/testdata/estimatedtimetable-request-soap.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header />
  <S:Body>
    <ns7:Subscribe xmlns:ns2="http://www.siri.org.uk/siri"
                           xmlns:ns3="http://www.ifopt.org.uk/acsb"
                           xmlns:ns4="http://www.ifopt.org.uk/ifopt"
                           xmlns:ns5="http://datex2.eu/schema/2_0RC1/2_0"
                           xmlns:ns6="http://scma/siri" xmlns:ns7="http://wsdl.siri.org.uk">
      <SubscriptionRequestInfo>
        <ns2:RequestTimestamp>2017-01-01T12:01:00.000Z</ns2:RequestTimestamp>
        <ns2:RequestorRef>_internal</ns2:RequestorRef>
        <ns2:MessageIdentifier>ETTSubscription:Test:0</ns2:MessageIdentifier>
        <ns2:ConsumerAddress>https://ara-staging.af83.io/test/siri</ns2:ConsumerAddress>
      </SubscriptionRequestInfo>
      <Request version="2.0:FR-IDF-2.4">
        <EstimatedTimetableSubscriptionRequest>
          <ns2:RequestTimestamp>2017-01-01T12:01:00.000Z</ns2:RequestTimestamp>
          <ns5:SubscriberRef>NINOXE:default</ns5:SubscriberRef>
          <ns5:SubscriptionRef>NINOXE:Subscription::6ba7b814-9dad-11d1-2-00c04fd430c8:LOC</ns5:SubscriptionRef>
          <MessageIdentifier>28679112-9dad-11d1-2-00c04fd430c8</MessageIdentifier>
          <ns5:InitialTerminationTime>2017-01-01T13:00:00.000Z</ns5:InitialTerminationTime>
          <ns2:Lines>
                <ns2:LineRef>6ba7b814-9dad-11d1-1-00c04fd430c8</ns2:LineRef>
          </ns2:Lines>
        </EstimatedTimetableSubscriptionRequest>
      </Request>
      <RequestExtension />
    </ns7:Subscribe>
  </S:Body>
</S:Envelope>
